#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
	
	ЮТТесты.ДобавитьТестовыйНабор("Тестирование создания документов").ВТранзакции()
		.ДобавитьТест("ПроверкаПроведенияССтатусомВРаботе", "Проверка проведения документов ""Заказ поставщику"" с статусом ""В работе""", "Позитив")
		.ДобавитьТест("ПроверкаДвиженийССтатусомВРаботе", "Проверка движений документов ""Заказ поставщику"" с статусом ""В работе""", "Позитив")  
		.ДобавитьТест("ПроверкаСозданияДокументовЗаданиеНаПримку", "Проверка создания и проведения документов ""Задание на приему"" по данным из броккера", "Позитив") 
		.ДобавитьТест("ПроверкаСозданияДокументовПоступление", "Проверка создания и проведения документов ""Поступление"" по данным из броккера", "Позитив");  
	КонецПроцедуры
		
	
Процедура ПроверкаПроведенияССтатусомВРаботе() Экспорт
	
	СтруктураПараметров=ПодготовитьДанные(); 
	
	
	СозданыйДокумент= ЮТест.Данные().КонструкторОбъекта("Документ.ЗаказПоставщику")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля 
	.Установить("Дата",ТекущаяДата())
	.Установить("Склад",СтруктураПараметров.Склад) 
	.Установить("Валюта",СтруктураПараметров.Валюта)
	.Установить("Поставщик",СтруктураПараметров.Контрагент)
	.Установить("Организация",СтруктураПараметров.Организация)
	.Установить("ВидЦен",СтруктураПараметров.ВидЦен)
	                                                                
	.ТабличнаяЧасть("Товары")                          
	.ДобавитьСтроку()                                                          
	.Установить("Товар", СтруктураПараметров.Товар)
	.Фикция("Цена")  
	.Установить("Количество",1)              
	.Фикция("Сумма")
	.Провести(Ложь);  
	
	ЮТест.ОжидаетЧто(СозданыйДокумент)
	.Заполнено()
	.ИмеетТип("ДокументСсылка.ЗаказПоставщику");
	
	
КонецПроцедуры      


Процедура ПроверкаДвиженийССтатусомВРаботе() Экспорт

СтруктураПараметров=ПодготовитьДанные();
	
	
	
	
	СозданыйДокумент= ЮТест.Данные().КонструкторОбъекта("Документ.ЗаказПоставщику")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля 
	.Установить("Дата",ТекущаяДата())
	.Установить("Склад",СтруктураПараметров.Склад) 
	.Установить("Валюта",СтруктураПараметров.Валюта)
	.Установить("Поставщик",СтруктураПараметров.Контрагент)
	.Установить("Организация",СтруктураПараметров.Организация)
	.Установить("ВидЦен",СтруктураПараметров.ВидЦен)
	.Установить("СостояниеЗаказа",Перечисления.СостоянияЗаказов.ВРаботе)
	
	.ТабличнаяЧасть("Товары")                          
	.ДобавитьСтроку()                                                          
	.Установить("Товар", СтруктураПараметров.Товар)
	.Фикция("Цена")  
	.Установить("Количество",1)                           
	.Фикция("Сумма")                                             
	.Провести(Ложь);  
	                                                  
	
	ЮТест.ОжидаетЧто(СозданыйДокумент)
		.Заполнено()                                             
		.Свойство("Проведен").ЭтоИстина();

	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрСведений.ОчередьСообщенийКОтправкеТС";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Отправлено");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("ID");  
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Сообщение");
	ОписаниеЗапроса.Условия.Добавить("Отправлено = Ложь");

 	
	РезультатЗапроса = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
		
		ЮТест.ОжидаетЧто(РезультатЗапроса)                                       
			.ИмеетДлину(1)

	
КонецПроцедуры    

Процедура ПроверкаСозданияДокументовЗаданиеНаПримку() Экспорт

СтруктураПараметров=ПодготовитьДанные();
	
	
КонецПроцедуры     


Процедура ПроверкаСозданияДокументовПоступление() Экспорт
СтруктураПараметров=ПодготовитьДанные();
	
КонецПроцедуры   





#КонецОбласти

#Область СлужебныеПроцедурыИФункции

      Функция ПодготовитьДанные()
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	Товар = ЮТест.Данные().КонструкторОбъекта("Справочник.Товары")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", "Тестовый товар")
		.Установить("Код", "Т0001")
		.Записать();
	
	Склад = ЮТест.Данные().КонструкторОбъекта("Справочник.Склады")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", "Тестовый склад")
		.Установить("Код", "Т0001")                          
		.Записать(); 
		
	Валюта = ЮТест.Данные().КонструкторОбъекта("Справочник.Валюты")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", "Тестовая Валюта")                                                  
		.Установить("Код", "Т0001")
		.Записать();  
	
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочник.Контрагенты")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", "Тестовый Контрагент")
		.Установить("Код", "Т0001")
		.Записать();                             
		
			
	Организация = ЮТест.Данные().КонструкторОбъекта("Справочник.Организации")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", "Тестовыая Организация")
		.Установить("Код", "Т0001")
		.Записать();  
		
	ВидЦен = ЮТест.Данные().КонструкторОбъекта("Справочник.ВидыЦен")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", "Тестовый вид цен")
		.Установить("Код", "Т0001")
		.Записать(); 

		СтруктураПараметровДокументов= Новый Структура;
		СтруктураПараметровДокументов.Вставить("Товар",Товар);
		СтруктураПараметровДокументов.Вставить("Склад",Склад);
		СтруктураПараметровДокументов.Вставить("Валюта",Валюта); 
		СтруктураПараметровДокументов.Вставить("Контрагент",Контрагент);
		СтруктураПараметровДокументов.Вставить("Организация",Организация);
		СтруктураПараметровДокументов.Вставить("ВидЦен",ВидЦен);
		
		
		Возврат   СтруктураПараметровДокументов;
		
КонецФункции



#КонецОбласти