#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Тестирование документов ""Приход,Расход""").ВТранзакции()
   	.ДобавитьТест("СозданиеДокументов", "", "Позитив")
	;
	//Добавил комментарий для задачи 00001
	//Вторая итерация по задаче 00001
	//Третья итерация по задаче 00001
	//4 итерация по задаче 00001
		//1 итерация по задаче 00005
		//2 итерация по задаче 00005
		//3 итерация по задаче 00005
		//1 итерация по задаче 00006
		//1 итерация по задаче 00007
		
		//Task1
		//Task1    
		//Task2    
		////Task8




КонецПроцедуры

Процедура СозданиеДокументов() Экспорт
	
	 	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	
	
	
	// 2. Выполнение функции.                    ПриходТовара
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
	.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
	.ТабличнаяЧасть("Товары")
	.ДобавитьСтроку()               
	.Фикция("Товар")
	.Фикция("Цена")  
	.Фикция("Количество")      
	.Фикция("Сумма")
	.Записать();               
	
	Сообщить("Создан документ: " + ПриходТовара.Номер);	
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(ПриходТовара, "Созданный объект")
	.Заполнено()
	.ИмеетТип("ДокументСсылка.ПриходТовара")		
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти